9/data/attachments/e5cbbbf880e1ca6.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_8bc5fb99-173a-4275-ba9b-1f332c175633</nif:username>
            <nif:friendToBeAdded>Patrick_range_Actions_68895_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>